grevaillot/svd_tools/headers/ATSAM3U1E/memorymap.h
#pragma once 

#define HSMCI_BASE			(0x40000000)
#define SSC_BASE			(0x40004000)
#define SPI_BASE			(0x40008000)
#define TC0_BASE			(0x40080000)
#define TWI0_BASE			(0x40084000)
#define TWI1_BASE			(0x40088000)
#define PWM_BASE			(0x4008c000)
#define USART0_BASE			(0x40090000)
#define USART1_BASE			(0x40094000)
#define USART2_BASE			(0x40098000)
#define USART3_BASE			(0x4009c000)
#define UDPHS_BASE			(0x400a4000)
#define ADC12B_BASE			(0x400a8000)
#define ADC_BASE			(0x400ac000)
#define DMAC_BASE			(0x400b0000)
#define SMC_BASE			(0x400e0000)
#define MATRIX_BASE			(0x400e0200)
#define PMC_BASE			(0x400e0400)
#define UART_BASE			(0x400e0600)
#define CHIPID_BASE			(0x400e0740)
#define EFC0_BASE			(0x400e0800)
#define PIOA_BASE			(0x400e0c00)
#define PIOB_BASE			(0x400e0e00)
#define PIOC_BASE			(0x400e1000)
#define RSTC_BASE			(0x400e1200)
#define SUPC_BASE			(0x400e1210)
#define RTT_BASE			(0x400e1230)
#define WDT_BASE			(0x400e1250)
#define RTC_BASE			(0x400e1260)
#define GPBR_BASE			(0x400e1290)
